package utils

// VERSION is the version of the program.
const VERSION = "0.0.1"

// scanModel Port scan mode
type scanModel string

const (
	// TCP scan mode
	TCP scanModel = "tcp"
	// Icmp scan mode
	Icmp scanModel = "icmp"
)

/*
	1433  端口：SQLServer数据库端口
	1521  端口：Oracle数据库端口
	3306  端口：MYSQL数据库端口
	5000  端口：DB2默认端口号
	5432  端口：Postgresql数据库端口
	6379  端口：Redis数据库端口
	9200  端口：Elasticsearch服务器端口
	27017 端口：mongoDB数据库默认端口
	22122 端口：fastdfs服务器默认端口
*/

// DefaultDatabasePorts default database ports Common db ports
var DefaultDatabasePorts = []string{"1433", "1521", "3306", "5000", "5432", "6379", "9200", "27017", "22122"}

// DefaultWebPorts default web ports Common web ports
var DefaultWebPorts = []string{"80", "81", "82", "83", "84", "85", "86", "87", "88", "89", "90", "91", "92", "98", "99",
	"443", "800", "801", "808", "880", "888", "889", "1000", "1010", "1080", "1081", "1082", "1099", "1118", "1888", "2008",
	"2020", "2100", "2375", "2379", "3000", "3008", "3128", "3505", "5555", "6080", "6648", "6868", "7000", "7001", "7002",
	"7003", "7004", "7005", "7007", "7008", "7070", "7071", "7074", "7078", "7080", "7088", "7200", "7680", "7687", "7688",
	"7777", "7890", "8000", "8001", "8002", "8003", "8004", "8006", "8008", "8009", "8010", "8011", "8012", "8016", "8018",
	"8020", "8028", "8030", "8038", "8042", "8044", "8046", "8048", "8053", "8060", "8069", "8070", "8080", "8081", "8082",
	"8083", "8084", "8085", "8086", "8087", "8088", "8089", "8090", "8091", "8092", "8093", "8094", "8095", "8096", "8097",
	"8098", "8099", "8100", "8101", "8108", "8118", "8161", "8172", "8180", "8181", "8200", "8222", "8244", "8258", "8280",
	"8288", "8300", "8360", "8443", "8448", "8484", "8800", "8834", "8838", "8848", "8858", "8868", "8879", "8880", "8881",
	"8888", "8899", "8983", "8989", "9000", "9001", "9002", "9008", "9010", "9043", "9060", "9080", "9081", "9082", "9083",
	"9084", "9085", "9086", "9087", "9088", "9089", "9090", "9091", "9092", "9093", "9094", "9095", "9096", "9097", "9098",
	"9099", "9100", "9200", "9443", "9448", "9800", "9981", "9986", "9988", "9998", "9999", "10000", "10001", "10002", "10004",
	"10008", "10010", "10250", "12018", "12443", "14000", "16080", "18000", "18001", "18002", "18004", "18008", "18080",
	"18082", "18088", "18090", "18098", "19001", "20000", "20720", "21000", "21501", "21502", "28018", "20880"}

/*
	21    端口：FTP服务器端口
	22    端口：SSH服务器端口
	135   端口：Windows RPC
	139   端口：NetBIOS
	445   端口：SMB服务器端口
	1433  端口：SQLServer数据库端口
	1521  端口：Oracle数据库端口
	3306  端口：MYSQL数据库端口
	3389  端口：RDP服务器端口
	5432  端口：Postgresql数据库端口
	6379  端口：Redis数据库端口
	9000  端口：FastCGI服务器端口
	11211 端口：Memcached服务器端口
*/

// DefaultServicePorts default service ports Common service ports
var DefaultServicePorts = []string{"21", "22", "135", "139", "445", "1433",
	"1521", "3306", "3389", "5432", "6379", "9000", "11211"}

var DefaultPorts []string

func GetDefaultPorts() []string {
	DefaultPorts = append(DefaultPorts, DefaultDatabasePorts...)
	DefaultPorts = append(DefaultPorts, DefaultWebPorts...)
	DefaultPorts = append(DefaultPorts, DefaultServicePorts...)
	return DefaultServicePorts
}
